import React, { useState } from "react";
import { motion } from "framer-motion";
import rastriyasava from "../assets/Homeimg/rastriya-sava.jpg";
import samachar from "../assets/samachar.jpg";
import cricket from "../assets/cricket.jpg";
import { Link, useParams } from "react-router-dom";


export const newsData = [
  {
    id: 1,
    title: "सरकारले घोषणा गर्यो नयाँ आर्थिक योजना",
    description:
      "नयाँ आर्थिक नीतिहरू लागू गर्दै सरकारले आगामी वर्षका लागि रणनीतिक योजना प्रस्तुत गरेको छ।",
    time: "१५ मिनेट अघि",
    image: rastriyasava,
    fulldescription: "दाङको देउखुरीबाट आएर काठमाडौंमा आन्दोलनरत स्वर्गद्वारी गुठीपीडित मोही किसानहरूलाई सरकारले वार्तामा बोलाएको छ।" +
      "भूमि व्यवस्था, सहकारी तथा गरीबी निवारण मन्त्रालयले स्वर्गद्वारी गुठीपीडित संघर्ष समितिको आन्दोलनप्रति गम्भीर ध्यानाकर्षण जनाउँदै वार्ताका लागि मन्त्रालयका सहसचिव मदन कोइरालाको संयोजकत्वमा तीन सदस्यीय समिति गठन गरेको छ। वार्ता समितिमा उपसचिव महेन्द्रप्रसाद साँखी र गुठी संस्थानका कानून अधिकृत जनक पोखरेल सदस्य रहेका छन्। यसबारे मन्त्रालयले मंगलबार जारी गरेको प्रेस विज्ञप्तिमा उल्लेख छ।" +
      "मन्त्रालयले संघर्षरत पक्षलाई पनि वार्ता टोली गठन गरी संवादमा आउन आग्रह गरेको छ। 'मन्त्रालयले विगतमा भएको सहमति कार्यान्वयनका लागि आवश्यक कारबाही अगाडि बढाइसकेको छ। आन्दोलनका क्रममा उठाइएका विषयवस्तुहरूलाई संवादमार्फत सम्बोधन गर्न संघर्षरत पक्षलाई वार्तामा आउन हार्दिक आह्वान गर्दछ,' विज्ञप्तिमा उल्लेख छ।\n\n" +
      "गुठीपीडित संघर्ष समितिले गत माघ २० गतेदेखि माइतीघर मण्डलामा धर्ना दिँदै आएको छ। मोही किसानहरूले मोहियानी हकको माग गर्दै गत वर्ष आन्दोलन गरेका थिए, जसपछि २०८० चैत ७ मा भूमि व्यवस्था मन्त्रालयले उनीहरूसँग वार्ता गरी सहमति गरेको थियो। तर, उक्त सहमति कार्यान्वयन नभएको भन्दै मोही किसानहरू यस वर्ष पनि काठमाडौंमा आन्दोलनरत छन्।" +
      "गत वर्ष भएको सहमतिअनुसार स्वर्गद्वारी आश्रमको जग्गामा बसोबास गर्ने मोही किसानहरूको माग सम्बोधन हुने गरी सरकार नयाँ एकीकृत कानून बनाउने प्रतिबद्धता व्यक्त गरिएको थियो। तर, एक वर्ष बित्न लाग्दा पनि सरकारले कानून निर्माणको प्रक्रिया अघि बढाएको छैन।",
  },
  {
    id: 2,
    title: "काठमाडौंमा बृहत् विरोध प्रदर्शन",
    description:
      "माओवादी अध्यक्ष एवं पूर्वप्रधानमन्त्री पुष्पकमल दाहालले ऐतिहासिक क्रान्ति, आन्दोलन र जनसंघर्षको बलमा प्राप्त उपलब्धिहरूको रक्षा गर्दै संविधानको कार्यान्वयनमार्फत् समाजवादउन्मुख राज्यको आधारशिला खडा गर्नु आजको राष्ट्रिय कार्यभार भएको बताएका छन् ।",
    time: "१ घण्टा अघि",
    image: rastriyasava,
    fulldescription: "दाङको देउखुरीबाट आएर काठमाडौंमा आन्दोलनरत स्वर्गद्वारी गुठीपीडित मोही किसानहरूलाई सरकारले वार्तामा बोलाएको छ।" +
      "भूमि व्यवस्था, सहकारी तथा गरीबी निवारण मन्त्रालयले स्वर्गद्वारी गुठीपीडित संघर्ष समितिको आन्दोलनप्रति गम्भीर ध्यानाकर्षण जनाउँदै वार्ताका लागि मन्त्रालयका सहसचिव मदन कोइरालाको संयोजकत्वमा तीन सदस्यीय समिति गठन गरेको छ। वार्ता समितिमा उपसचिव महेन्द्रप्रसाद साँखी र गुठी संस्थानका कानून अधिकृत जनक पोखरेल सदस्य रहेका छन्। यसबारे मन्त्रालयले मंगलबार जारी गरेको प्रेस विज्ञप्तिमा उल्लेख छ।" +
      "मन्त्रालयले संघर्षरत पक्षलाई पनि वार्ता टोली गठन गरी संवादमा आउन आग्रह गरेको छ। 'मन्त्रालयले विगतमा भएको सहमति कार्यान्वयनका लागि आवश्यक कारबाही अगाडि बढाइसकेको छ। आन्दोलनका क्रममा उठाइएका विषयवस्तुहरूलाई संवादमार्फत सम्बोधन गर्न संघर्षरत पक्षलाई वार्तामा आउन हार्दिक आह्वान गर्दछ,' विज्ञप्तिमा उल्लेख छ।\n\n" +
      "गुठीपीडित संघर्ष समितिले गत माघ २० गतेदेखि माइतीघर मण्डलामा धर्ना दिँदै आएको छ। मोही किसानहरूले मोहियानी हकको माग गर्दै गत वर्ष आन्दोलन गरेका थिए, जसपछि २०८० चैत ७ मा भूमि व्यवस्था मन्त्रालयले उनीहरूसँग वार्ता गरी सहमति गरेको थियो। तर, उक्त सहमति कार्यान्वयन नभएको भन्दै मोही किसानहरू यस वर्ष पनि काठमाडौंमा आन्दोलनरत छन्।" +
      "गत वर्ष भएको सहमतिअनुसार स्वर्गद्वारी आश्रमको जग्गामा बसोबास गर्ने मोही किसानहरूको माग सम्बोधन हुने गरी सरकार नयाँ एकीकृत कानून बनाउने प्रतिबद्धता व्यक्त गरिएको थियो। तर, एक वर्ष बित्न लाग्दा पनि सरकारले कानून निर्माणको प्रक्रिया अघि बढाएको छैन।",
  },
  {
    id: 3,
    title: "नेपाल क्रिकेट टिमको नयाँ रणनीति",
    description:
      "पूर्वराष्ट्रपति विद्यादेवी भण्डारीले मुलुकको सर्वाङ्गीण विकास र समृद्धिका लागि निरन्तर लाग्न सबै राजनीतिक दल, नागरिक समाज, सरोकार भएका निकायलाई आग्रह गरेका छन् । ",
    time: "२ घण्टा अघि",
    image: cricket,
    fulldescription: "दाङको देउखुरीबाट आएर काठमाडौंमा आन्दोलनरत स्वर्गद्वारी गुठीपीडित मोही किसानहरूलाई सरकारले वार्तामा बोलाएको छ।" +
      "भूमि व्यवस्था, सहकारी तथा गरीबी निवारण मन्त्रालयले स्वर्गद्वारी गुठीपीडित संघर्ष समितिको आन्दोलनप्रति गम्भीर ध्यानाकर्षण जनाउँदै वार्ताका लागि मन्त्रालयका सहसचिव मदन कोइरालाको संयोजकत्वमा तीन सदस्यीय समिति गठन गरेको छ। वार्ता समितिमा उपसचिव महेन्द्रप्रसाद साँखी र गुठी संस्थानका कानून अधिकृत जनक पोखरेल सदस्य रहेका छन्। यसबारे मन्त्रालयले मंगलबार जारी गरेको प्रेस विज्ञप्तिमा उल्लेख छ।" +
      "मन्त्रालयले संघर्षरत पक्षलाई पनि वार्ता टोली गठन गरी संवादमा आउन आग्रह गरेको छ। 'मन्त्रालयले विगतमा भएको सहमति कार्यान्वयनका लागि आवश्यक कारबाही अगाडि बढाइसकेको छ। आन्दोलनका क्रममा उठाइएका विषयवस्तुहरूलाई संवादमार्फत सम्बोधन गर्न संघर्षरत पक्षलाई वार्तामा आउन हार्दिक आह्वान गर्दछ,' विज्ञप्तिमा उल्लेख छ।\n\n" +
      "गुठीपीडित संघर्ष समितिले गत माघ २० गतेदेखि माइतीघर मण्डलामा धर्ना दिँदै आएको छ। मोही किसानहरूले मोहियानी हकको माग गर्दै गत वर्ष आन्दोलन गरेका थिए, जसपछि २०८० चैत ७ मा भूमि व्यवस्था मन्त्रालयले उनीहरूसँग वार्ता गरी सहमति गरेको थियो। तर, उक्त सहमति कार्यान्वयन नभएको भन्दै मोही किसानहरू यस वर्ष पनि काठमाडौंमा आन्दोलनरत छन्।" +
      "गत वर्ष भएको सहमतिअनुसार स्वर्गद्वारी आश्रमको जग्गामा बसोबास गर्ने मोही किसानहरूको माग सम्बोधन हुने गरी सरकार नयाँ एकीकृत कानून बनाउने प्रतिबद्धता व्यक्त गरिएको थियो। तर, एक वर्ष बित्न लाग्दा पनि सरकारले कानून निर्माणको प्रक्रिया अघि बढाएको छैन।",
  },
  {
    id: 4,
    title: "संविधान कार्यान्वयनमार्फत समाजवाद उन्मुख राज्यको आधारशिला",
    description:
      "नयाँ संविधानको कार्यान्वयनसँगै समाजवाद उन्मुख राज्य निर्माणका लागि नयाँ नीति ल्याइएको छ।",
    time: "३० मिनेट अघि",
    image: rastriyasava,
    fulldescription: "दाङको देउखुरीबाट आएर काठमाडौंमा आन्दोलनरत स्वर्गद्वारी गुठीपीडित मोही किसानहरूलाई सरकारले वार्तामा बोलाएको छ।" +
      "भूमि व्यवस्था, सहकारी तथा गरीबी निवारण मन्त्रालयले स्वर्गद्वारी गुठीपीडित संघर्ष समितिको आन्दोलनप्रति गम्भीर ध्यानाकर्षण जनाउँदै वार्ताका लागि मन्त्रालयका सहसचिव मदन कोइरालाको संयोजकत्वमा तीन सदस्यीय समिति गठन गरेको छ। वार्ता समितिमा उपसचिव महेन्द्रप्रसाद साँखी र गुठी संस्थानका कानून अधिकृत जनक पोखरेल सदस्य रहेका छन्। यसबारे मन्त्रालयले मंगलबार जारी गरेको प्रेस विज्ञप्तिमा उल्लेख छ।" +
      "मन्त्रालयले संघर्षरत पक्षलाई पनि वार्ता टोली गठन गरी संवादमा आउन आग्रह गरेको छ। 'मन्त्रालयले विगतमा भएको सहमति कार्यान्वयनका लागि आवश्यक कारबाही अगाडि बढाइसकेको छ। आन्दोलनका क्रममा उठाइएका विषयवस्तुहरूलाई संवादमार्फत सम्बोधन गर्न संघर्षरत पक्षलाई वार्तामा आउन हार्दिक आह्वान गर्दछ,' विज्ञप्तिमा उल्लेख छ।\n\n" +
      "गुठीपीडित संघर्ष समितिले गत माघ २० गतेदेखि माइतीघर मण्डलामा धर्ना दिँदै आएको छ। मोही किसानहरूले मोहियानी हकको माग गर्दै गत वर्ष आन्दोलन गरेका थिए, जसपछि २०८० चैत ७ मा भूमि व्यवस्था मन्त्रालयले उनीहरूसँग वार्ता गरी सहमति गरेको थियो। तर, उक्त सहमति कार्यान्वयन नभएको भन्दै मोही किसानहरू यस वर्ष पनि काठमाडौंमा आन्दोलनरत छन्।" +
      "गत वर्ष भएको सहमतिअनुसार स्वर्गद्वारी आश्रमको जग्गामा बसोबास गर्ने मोही किसानहरूको माग सम्बोधन हुने गरी सरकार नयाँ एकीकृत कानून बनाउने प्रतिबद्धता व्यक्त गरिएको थियो। तर, एक वर्ष बित्न लाग्दा पनि सरकारले कानून निर्माणको प्रक्रिया अघि बढाएको छैन।",
  },
  {
    id: 5,
    title: "सरकारले घोषणा गर्यो नयाँ आर्थिक योजना",
    description:
      "नयाँ आर्थिक नीतिहरू लागू गर्दै सरकारले आगामी वर्षका लागि रणनीतिक योजना प्रस्तुत गरेको छ।",
    time: "१५ मिनेट अघि",
    image: samachar,
  },
];

const Artha = () => {
  const [news] = useState(newsData);
  const mainmsgtitle = "संविधान कार्यान्वयनमार्फत समाजवाद उन्मुख राज्यको आधारशिला";


  const mainmsgdescription = "रियो द जेनरियो । ब्राजिलका पूर्व राष्ट्रपति येर बोल्सोनारोविरुद्ध अभियोग दर्ता गरिएको छ । २०२२ को राष्ट्रपति निर्वाचनमा हारेपछि कूको प्रयास गरेको भन्दै प्रमुख अभियोजनले उनीविरुद्ध अभियोग लगाइएका हुन् ।  राष्ट्रपति लुइज इनासियो लुला ..."



  return (
    <>
      <div className="pt-2 pb-12">
        <div className="mx-auto px-6 md:px-12 py-6 w-[100%] bg-white shadow-lg space-y-10">
          {/* Section Header */}
          <div className="pb-8">
            <div className="flex items-center">
              <h2 className="text-2xl text-[#F05922] font-bold whitespace-nowrap mr-4">अर्थ</h2>
              <div className="flex flex-col w-full leading-none">
                <p className="border-b-[2px] border-[#F05922] w-full"></p>
                <p className="border-b-[2px] border-[#0066B3] w-full mt-[1px]"></p>
              </div>
            </div>
          </div>

          {/* Main news */}
          <div className="flex gap-12 flex-col md:flex-row">
            {/* img section */}
            <div className="md:w-[70%]">
              <img className="rounded-lg object-cover cursor-pointer w-full" src={rastriyasava} alt="Main News"/>
            </div>
            <div className="md:w-[50%] md:mt-6">
              <h1 className="font-bold md:text-[32px] text-[24px] cursor-pointer hover:text-[#F05922] mb-5 transition-colors duration-300">
                {mainmsgtitle}
              </h1>
              <p className="text-[#333333] text-[17px]">{mainmsgdescription}</p>
            </div>
          </div>

          <div className="border-[#d3d1d1] border-[1.5px]"></div>

          {/* News List */}
          <div className="flex flex-col gap-8">
            {news.map((item) => (
              <Link to={`/ArthaDetails/${item.title}`} key={item.id}>
                <motion.div
                  className="flex flex-col md:flex-row items-center gap-8 bg-white rounded-lg shadow-md overflow-hidden cursor-pointer p-6 hover:shadow-lg transition-all duration-300"
                  whileHover={{ scale: 1.02 }}
                >
                  {/* Text Content (Left) */}
                  <div className="flex-1 w-full md:w-80 space-y-4">
                    <h3 className="text-xl font-bold text-[#595A5C] hover:text-[#F05922] transition-colors duration-300">
                      {item.title}
                    </h3>
                    <p className="text-[#333333] text-[15px]">{item.description}</p>
                    <span className="text-sm text-gray-500 block">{item.time}</span>
                  </div>

                  {/* Image (Right) */}
                  <div className="w-full md:w-60 md:h-44 flex-shrink-0">
                    <img
                      src={item.image}
                      alt={item.title}
                      className="w-full h-full object-cover rounded-lg"
                    />
                  </div>
                </motion.div>
              </Link>
            ))}
          </div>
        </div>
      </div>
    </>
  );
};

export default Artha;
